In [47]:
import pandas as pd
import numpy as np
import math 
from sklearn import linear_model
import math

from word2number import w2n

In [48]:
df = pd.read_csv('Exercise\hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [51]:
df.rename(columns={ 'experience':'exp',
                    'test_score(out of 10)':'test_score',
                   'interview_score(out of 10)':'interview_score',
                   'salary($)':'salary'
                  },inplace=True)
df.exp=df.exp.fillna('zero')

test_score_mean=math.floor(df.test_score.mean())
df.test_score=df.test_score.fillna(test_score_mean)
df

      exp  test_score  interview_score  salary
0    zero         8.0                9   50000
1    zero         8.0                6   45000
2    five         6.0                7   60000
3     two        10.0               10   65000
4   seven         9.0                6   70000
5   three         7.0               10   62000
6     ten         7.0                7   72000
7  eleven         7.0                8   80000

In [52]:
def numword(item):                     #Created a function to make the applymap function work
                                       
    return w2n.word_to_num(item)
df2 = pd.DataFrame(df,columns=['exp'])
df2=df2.applymap(numword)

#Could've used apply function instead.

In [55]:
df.exp=df2.exp
reg = linear_model.LinearRegression()
reg.fit(df[['exp','test_score','interview_score']].values,df.salary)
reg.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [56]:
reg.predict([[2,9,6]])

array([53713.86677124])